from matplotlib import pyplot as plt
input("""\t\t\t Структурное програмирование!""")

img = plt.imread('/home/bsg/Desktop/shkola/Kurs_piton/struktur_pr7/opis.png')
plt.imshow(img)
plt.show()

input("""Структурное програмирование, по большому счету, цепочка выполнения блокового кода.
Есть влетвления в коде, но не большого диапазона. Для понимания структурного 
програмирования
нужно сравнить с чем либо, забегая на перед, есть ООП в питоне да и не только, так вот
структурное програмирование словно капельки падающие в низ, стремящиеся достичь 
конечного результата
ООП-это те-же капельки, но уже упавшие в воду и волны разбигающие по окружности и есть
метод ООП. Код расползается во все стороны.
Для полного понемания структурного програмирования нежен пример к пояснению:""")

img = plt.imread('/home/bsg/Desktop/shkola/Kurs_piton/struktur_pr7/logika.png')
plt.imshow(img)
plt.show()

input("""Логическое выражения поможе в полной мере освоить данную тему.
Булевый тип-bool относится к двум направлениям: True и False
True это положительный тип данных к которому относится, если цифры, то 
от еденици и выше, так-же присуствия любого символаю
False это отрицательный тип данных, к которому относится, если цифры, то
все что ниже еденици, ноль -1 и т.д и т.п. Так-же к False относится и нечего 
print(bool())
False""")

input("""Одно разьеснения к двум утверждениям:
input('str: \t')
    if student == '':
        print('Nonen') Non это ничего
    else:
        print('True')
Это были строки.

int(input('namber: \n'))
    if student(int()) >= 1:
        print('True')
    else:
        print('False')
Это были числа.
Конструкция (if, elif, else) хороший пример, 
который относится к Структурному програмированию. Программа же эта
относится к ООП.""")

img = plt.imread('/home/bsg/Desktop/shkola/Kurs_piton/struktur_pr7/opera_srav.png')
plt.imshow(img)
plt.show()






